[
    {
        "title": "My Pet Pal",
        "id": "9",
        "subtitle": "iOS mobile app to keep track of your puppy's activities and well-being.",
        "description": "<p>Since I started intensive bootcamp study, I forgot to take my dog outside several times in the morning. This always made my fiance grumpy, so I decided to make this app to solve this problem. This iOS app enables users to collaboratively manage dogs' daily activities. I worked with a UX designer and a UI designer to improve the user experience. I wrote the entire app front to back including the backend, the database, and the iOS frontend.</p>",
        "takeAway": "It was really fun to build a polished iOS app and test it on multiple devices including iPhone 6, iPhone Xr and iPad. Buiding this app definitely made me want to learn native languages.",
        "technology": "React Native, Redux, Expo, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/banjo.png",
        "icon": "../images/dog.png",
        "videoSrcURL": "https://www.youtube.com/embed/-YDvsXGxs_Y",
        "videoTitle": "My Pet Pal - React Native IOS App Demo",
        "demo": "https://youtu.be/-YDvsXGxs_Y",
        "github":  "https://github.com/banjo-project"
    },
    {
        "title": "My Portfolio Web Site",
        "id": "8",
        "subtitle": "A single page web application to share my projects and posts.",
        "description": "<p>I chose Gatby to build my personal portfolio web site, because it is purpose-built for static single page apps. Also, Gatsby makes it super easy to access data through GraphQL, and I've always wanted to learn about GraphQL.</p>",
        "takeAway": "I have designed and built lots of different RESTful APIs for my previous projects. I thought the idea of GraphQL was really cool because I have experienced some overfetching of data in my previous projects. Fetching all of the data that I need in just one query instead of requesting data from a bunch of different endpoints seemed really smart and efficient. There were some challenges when these magic that Gatsby does behind the scenes gave me abstract error messages, but everthing just worked like what Gatsby is praised for.",
        "technology": "GraphQL, Gatsby, JavaScript, React",
        "image": "../images/portfolio.png",
        "icon": "../images/resume.png",
        "videoSrcURL": "",
        "videoTitle": "",
        "demo": "http://sarahlee.life/",
        "github":  "https://github.com/sarahselee223/my_blog"
    },
    {
        "title": "iOS Movie App",
        "id": "7",
        "subtitle": "iOS mobile app to save and manage a list of your favorite movies.",
        "description": "<p> I made this app to practice building React Native iOS app. I worked on fetching data from APIs, utilizing a 3rd party library, and styling an app.</p>",
        "takeAway": "There are pros and cons about using Expo, but I used Expo for real device visual testing including iPhone and iPad. I also learned how to build layouts with Flexbox.",
        "technology": "React Native, Ajax, Expo, JavaScript",
        "image": "../images/banjo.png",
        "icon": "../images/movie.png",
        "videoSrcURL": "https://www.youtube.com/embed/Us_lwexUmpk",
        "videoTitle": "Movie app demo",
        "demo": "https://www.youtube.com/watch?v=Us_lwexUmpk",
        "github":  "https://github.com/sarahselee223/movie-ios-app"
    },
    {
        "title": "Invoice Generator",
        "id": "6",
        "subtitle": "Invoice generator app for freelancer developers.",
        "description": "<p> I collaborated with a team of 4 other developers to create an invoice generator app for freelance developers. </p>",
        "takeAway": "I designed and built RESTful APIs, implemented routing, and implemented authorization and authentication in the backend. For the frontend, I worked on fetching invoice data and deleting invoice function. I also improved the user experience by building error handling in this project.",
        "technology": "JavaScript, Bulma, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/invoice.png",
        "icon": "../images/list.png",
        "demo": "http://invoice-creator.surge.sh",
        "github":  "https://github.com/Galvanize-Gals"
    },
    {
        "title": "Discover Local",
        "id": "5",
        "subtitle": "Hackathon Project : Traval application for international travelors",
        "description": "<p> This was my first hackathon and my team placed as the 2nd runner up! The challenge was to create an innovative travel application using Discover Card’s APIs in order to improve the travel  experience for travelers around the world. Our solution was to connect travelers with someone local who speaks the same language and also knows the country's culture.</p>",
        "takeAway": "It was challenging to create an app under intense time constraints. Also, it was challenging to use their external APIs with OAuth2.0 because I learned about calling APIs roughly a week before the hackathon. However, my team successfully managed to implement external APIs and compelted this prototype app in time. It was a fun experience to collaborate as a cross-functional team with a UI designer and a UX designer.",
        "technology": "JavaScript, Node.js, Knex, Ajax",
        "image": "../images/banjo.png",
        "icon": "../images/travel.png",
        "videoSrcURL": "https://www.youtube.com/embed/bxIhKtLZz9w",
        "videoTitle": "Hackathon - Discover Local",
        "demo": "http://youtu.be/bxIhKtLZz9w",
        "github":  ""
    },
    {
        "title": "Singular Focus",
        "id": "4",
        "subtitle": "Web application to manage team work and tasks",
        "description": "<p> I worked with a team of 3 developers to develop an app that enables users to manage and focus on tasks and managers to have an at-a-glance overview of the team’s activities.</p>",
        "takeAway": "I designed and built the database and most of the APIs. I also worked on designing the app's UI & UX by using React-Bulma. If you are  beginner or intermediate level with HTML & CSS, I would recommend using React-Bootstrap instead of React-Bulma, because React-Bootstrap's documentation and community is better.",
        "technology": "JavaScript, React, Redux, React-Bulma, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/taskmanger.png",
        "icon": "../images/list.png",
        "demo": "https://github.com/task-management-project",
        "github":  "https://github.com/task-management-project"
    },
    {
        "title": "React BookStore",
        "id": "3",
        "subtitle": "Prototype local bookstore app",
        "description": "<p> This is a prototype local bookstore app for managing book inventory, search for books, and checkout books.</p>",
        "takeAway": "",
        "technology": "JavaScript, React, Bootstrap, Ajax",
        "image": "../images/bookstore.png",
        "icon": "../images/books.png",
        "demo": "https://nameless-citadel-70518.herokuapp.com/",
        "github":  "https://github.com/sarahselee223/react-bookstore"
    },
    {
        "title": "Puppy Love",
        "id": "2",
        "subtitle": "Frontend prototype for dog adoption website",
        "description": "<p>Worked with one other developer to create a frontend prototype for a website for dog adoption.</p>",
        "takeAway": "I discovered that I really enjoy designing applications by completing this project.",
        "technology": "JavaScript, HTML, CSS, Bootstrap",
        "image": "../images/puppylove.png",
        "icon": "../images/pet.png",
        "demo": "http://puppy-love-galvanize.surge.sh/",
        "github":  "https://github.com/sarahselee223/puppy-love"
    },
    {
        "title": "Survival Tool in America",
        "id": "1",
        "subtitle": "Unit Converter",
        "description": "<p>I've been living in the States for 7 years but it is still hard to convert measurements. This is my first project made with basic HTML, CSS and JavaScript. It's a single page web app which converts between 13 essential units that are used in daily life in the world.</p>",
        "takeAway": "",
        "technology": "JavaScript, HTML, CSS",
        "image": "../images/unit_converter.png",
        "icon": "../images/america.png",
        "demo": "http://busy-game.surge.sh/",
        "github":  "https://github.com/sarahselee223/unit_converter"
    }
]