[
    {
        "title": "My Pet Pal",
        "id": "1",
        "subtitle": "iOS mobile app to keep track of your puppy's activities and well-being.",
        "description": "<p>Since I started intensive bootcamp study, I forgot to take my dog outside several times in the morning. This always made my boy friend grumpy, so I decided to make this app. This iOS app enables users to collaboratively manage dog's daily activities. I worked with an UX designer and an UI designer for better user experience. I designed database, and worked on backend APIs, front-end design, frontend and backend connection, error handling, and styling.</p>",
        "takeAway": "It was really fun to build polished iOS app and test in multiple devices including iPhone 6, iPhone Xr and iPad. Buiding this app definitely made me want to learn native languages. It was mindblowing once I learned that Swift with Xcode takes multiple images for different devices' resolution.",
        "technology": "React Native, Redux, Expo, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/banjo.png",
        "icon": "../images/dog.png",
        "videoSrcURL": "https://www.youtube.com/embed/-YDvsXGxs_Y",
        "videoTitle": "My Pet Pal - React Native IOS App Demo",
        "demo": "https://youtu.be/-YDvsXGxs_Y",
        "github":  "https://github.com/banjo-project"
    },
    {
        "title": "iOS Movie App",
        "id": "2",
        "subtitle": "iOS mobile app to save and manage a list of your favorite movies.",
        "description": "<p> I made this app to practice how to build react native iOS app. I worked on fetching data from APIs, utilizing a 3rd party library, and styling an app.</p>",
        "takeAway": "There are pros and cons about using Expo, but I used Expo for real device visual testing including iPhone and iPadI. I also learned Building layouts with Flexbox.",
        "technology": "React Native, Ajax, Expo, JavaScript",
        "image": "../images/banjo.png",
        "icon": "../images/movie.png",
        "videoSrcURL": "https://www.youtube.com/embed/Us_lwexUmpk",
        "videoTitle": "Movie app demo",
        "demo": "https://www.youtube.com/watch?v=Us_lwexUmpk",
        "github":  "https://github.com/sarahselee223/movie-ios-app"
    },
    {
        "title": "Invoice Generator",
        "id": "3",
        "subtitle": "Invoice generator app for freelancer developers.",
        "description": "<p> I collaborated with a team of 4 other developers to create an invoice generator app for freelance developers. I was responsible for backend routing and frontend reading invoice page and delete invoice function.</p>",
        "takeAway": "I designed and built RESTful APIs and implemented authorization and authentication in backend. For frontend, I worked on fetching invoice data and deleting invoice function. I also improved user experience by handling errors in this project.",
        "technology": "JavaScript, Bulma, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/invoice.png",
        "icon": "../images/list.png",
        "demo": "http://invoice-creator.surge.sh",
        "github":  "https://github.com/Galvanize-Gals"
    },
    {
        "title": "Discover Local",
        "id": "4",
        "subtitle": "Hackathon Project : Traval application for international travelors",
        "description": "<p> This was my first hackathon and my team got the 2nd runner up winner! The challenge was to create an innovative travel application using Discover Card’s APIs in order to improve travelers travel experience around the world. Our solution was to connect travelers with someone local who speaks the same language and also know the country's culture.</p>",
        "takeAway": "It was challenging to create an app under intense time constraints. Also, it was challenging to using their external APIs with OAuth2.0 because I learned about APIs like a week before the hackathon. However, my team successfully managed to implement external APIs and made this awesome app in a time! It was a fun experience to collaborating as a cross-functional team with UI designer and UX designer.",
        "technology": "JavaScript, Node.js, Knex, Ajax",
        "image": "../images/banjo.png",
        "icon": "../images/travel.png",
        "videoSrcURL": "https://www.youtube.com/embed/bxIhKtLZz9w",
        "videoTitle": "Hackathon - Discover Local",
        "demo": "http://youtu.be/bxIhKtLZz9w",
        "github":  ""
    },
    {
        "title": "Singular Focus",
        "id": "5",
        "subtitle": "Web application to manage team work and tasks",
        "description": "<p> I worked with a team of 3 developers to develop an app that enables users to manage and focus tasks and managers to have an at-a-glance overview of the team’s activities.</p>",
        "takeAway": "I designed and built database and most of the APIs. I also worked on designing the app's UI & UX by using react-bulma.",
        "technology": "JavaScript, React, Redux, React-Bulma, Node.js, Knex, Ajax, PostgreSQL",
        "image": "../images/taskmanger.png",
        "icon": "../images/list.png",
        "demo": "https://github.com/task-management-project",
        "github":  "https://github.com/task-management-project"
    },
    {
        "title": "React BookStore",
        "id": "6",
        "subtitle": "Prototype local bookstore app",
        "description": "<p> This is a prototype Local Bookstore app for managing book inventory, search books, and checkout books.</p>",
        "takeAway": "",
        "technology": "JavaScript, React, Bootstrap",
        "image": "../images/bookstore.png",
        "icon": "../images/books.png",
        "demo": "https://nameless-citadel-70518.herokuapp.com/",
        "github":  "https://github.com/sarahselee223/react-bookstore"
    },
    {
        "title": "Puppy Love",
        "id": "7",
        "subtitle": "Frontend prototype for dog adoption website",
        "description": "<p>Worked with one other developer to create a frontend prototype for a website for dog adoption.</p>",
        "takeAway": "I discovered that I really enjoy designing website by completing this project.",
        "technology": "JavaScript, HTML, CSS, Bootstrap",
        "image": "../images/puppylove.png",
        "icon": "../images/pet.png",
        "demo": "http://puppy-love-galvanize.surge.sh/",
        "github":  "https://github.com/sarahselee223/puppy-love"
    },
    {
        "title": "Survival Tool in America",
        "id": "8",
        "subtitle": "Unit Converter",
        "description": "<p>I've been living in the States for 7 years but it still is hard to converts measurements. This is my first project made with basic HTML, CSS and JavaScript. This is a simple tool converts between 13 essential units that are used in daily life in the world.</p>",
        "takeAway": "",
        "technology": "JavaScript, HTML, CSS",
        "image": "../images/unit_converter.png",
        "icon": "../images/america.png",
        "demo": "http://busy-game.surge.sh/",
        "github":  "https://github.com/sarahselee223/unit_converter"
    }
]